In [4]:
import pandas as pd
import numpy as np

In [8]:
import mysql.connector as mc

# step1.connect to your database server

In [11]:
connection = mc.connect(user="root", host="localhost", password="123456789")

# step2:To grant access to database server;

In [13]:
cur = connection.cursor()

In [14]:
mysql_query1 = """show databases""" # to show all database in mysql server
cur = connection.cursor()
cur.execute(mysql_query1)
cur.fetchall()

[('anthony_ruth',),
 ('assignment',),
 ('class work',),
 ('classicmodels',),
 ('classwork',),
 ('information_schema',),
 ('j',),
 ('lasop2023',),
 ('mysql',),
 ('olowoira',),
 ('orderdetails',),
 ('performance_schema',),
 ('ruthy',),
 ('second database',),
 ('student',),
 ('sys',)]

In [16]:
mysql_query1 = """use orderdetails""" # to show all database in mysql server
cur = connection.cursor()
cur.execute(mysql_query1)
connection.commit()

In [17]:
# select everything from customer table in `orderdetails`
mysql_query2 = """select * from customer""" # to show all
pd.read_sql_query(mysql_query2, connection)

C:\Users\HP\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   customer_id       fullname   phone no  state
0            1     james kola    2234555  Lagos
1            2        ola obi    5435566  Lagos
2            3       ada alao  947328987  Abuja
3            4   ruth anthony     839998   Kano
4            5  rasheed amole     938387  Lagos
5            6   idris noheem     738727  Abuja
6            7        ola ada      92828   Kano
7            8  adebis sancho      83837   Kano
8            9   yusuf kayode     837737  Lagos
9           10  Richael, odun  947328987   Kano